src/tr069/samples/tr069_download_req.xml

<soapenv:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
      <cwmp:ID soapenv:mustUnderstand="1"> 678322360 </cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
      <cwmp:Download>
        <CommandKey>DownloadCommandKey</CommandKey>
        <FileType>1 FirmWare Upgrade Image</FileType>
        <URL>https://bhlab-cms-cpefw.verizon.com/westell/A90-9100VM15-10=1.03.05.03C.rmt</URL>
        <Username></Username>
        <Password></Password>
        <FileSize>6261154</FileSize>
        <TargetFileName></TargetFileName>
        <DelaySeconds>1</DelaySeconds>
        <SuccessURL></SuccessURL>
        <FailureURL></FailureURL>
     </cwmp:Download>
   </soapenv:Body>
</soapenv:Envelope>
